tutorials/addSpecificBCs-sides/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    // front
    // {
    //     type            prghPressure;
    //     p               $internalField;
    //     value           $internalField;
    // }
    front
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    left
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    back
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    right
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    // outlet
    // {
    //     type            prghPressure;
    //     p               $internalField;
    //     value           $internalField;
    // }
    outlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    hole
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
