tutorials/addSpecificBCs-sides/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 310;

boundaryField
{
    // floor
    // {
    // type fixedValue;
    // value uniform 440;
    // }
    floor
    {
        type            fixedValue;
        value           uniform 320;
    }
    ceiling
    	{
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_          0.4;
        }
    front
    	{
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_          0.4;
        }
    left
    	{
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_          0.4;
        }
    back
    	{
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_          0.4;
        }
    right
    	{
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_          0.4;
        }
    hole
    {
        type            fixedValue;
        value           uniform 300;
    }

    // outlet
    // {
    //     type            zeroGradient;
    // }
}


// ************************************************************************* //
