tutorials/addSpecificBCs-sides/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    ceiling
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    front
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    left
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    right
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    // inlet
    // {
    //     type            turbulentIntensityKineticEnergyInlet;
    //     intensity       0.14;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    // }
    hole
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
